hparracho/Xarmlib/external/FSL/fsl_mkv58F24_cmsis.h
/*! @name SAMPTIM - HSADC Sampling Time Configuration Register */
/*! @{ */
#define HSADC_SAMPTIM_SAMPT_A_MASK               (0xFFU)
#define HSADC_SAMPTIM_SAMPT_A_SHIFT              (0U)
#define HSADC_SAMPTIM_SAMPT_A(x)                 (((uint16_t)(((uint16_t)(x)) << HSADC_SAMPTIM_SAMPT_A_SHIFT)) & HSADC_SAMPTIM_SAMPT_A_MASK)
#define HSADC_SAMPTIM_SAMPT_B_MASK               (0xFF00U)
#define HSADC_SAMPTIM_SAMPT_B_SHIFT              (8U)
#define HSADC_SAMPTIM_SAMPT_B(x)                 (((uint16_t)(((uint16_t)(x)) << HSADC_SAMPTIM_SAMPT_B_SHIFT)) & HSADC_SAMPTIM_SAMPT_B_MASK)
/*! @} */

/*! @name CALIB - HSADCs Calibration Configuration */
/*! @{ */
#define HSADC_CALIB_REQSINGA_MASK                (0x1U)
#define HSADC_CALIB_REQSINGA_SHIFT               (0U)
/*! REQSINGA - ADCA Calibration request for single ended mode
 *  0b0..Calibration value calculation is not requested to be run on ADCA.
 *  0b1..Calibration value calculation for single-ended input mode is requested to be run on ADCA.
 */
#define HSADC_CALIB_REQSINGA(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_REQSINGA_SHIFT)) & HSADC_CALIB_REQSINGA_MASK)
#define HSADC_CALIB_REQDIFA_MASK                 (0x2U)
#define HSADC_CALIB_REQDIFA_SHIFT                (1U)
/*! REQDIFA - ADCA Calibration request for differential mode
 *  0b0..Calibration value calculation is not requested to ADCA.
 *  0b1..Calibration value calculation for differential input mode is requested to be run on ADCA.
 */
#define HSADC_CALIB_REQDIFA(x)                   (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_REQDIFA_SHIFT)) & HSADC_CALIB_REQDIFA_MASK)
#define HSADC_CALIB_BYPA_MASK                    (0x4U)
#define HSADC_CALIB_BYPA_SHIFT                   (2U)
/*! BYPA - ADCA calibration bypass
 *  0b0..ADCA block uses the calibration values to obtain the final conversion result (differential or single-ended mode)
 *  0b1..Calibration operation is bypassed on ADCA.
 */
#define HSADC_CALIB_BYPA(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_BYPA_SHIFT)) & HSADC_CALIB_BYPA_MASK)
#define HSADC_CALIB_CAL_REQA_MASK                (0x8U)
#define HSADC_CALIB_CAL_REQA_SHIFT               (3U)
/*! CAL_REQA - Calibration Request for ADCA
 *  0b0..None.
 *  0b1..Calibration request for ADCA.
 */
#define HSADC_CALIB_CAL_REQA(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_CAL_REQA_SHIFT)) & HSADC_CALIB_CAL_REQA_MASK)
#define HSADC_CALIB_REQSINGB_MASK                (0x10U)
#define HSADC_CALIB_REQSINGB_SHIFT               (4U)
/*! REQSINGB - ADCB Calibration request for single ended mode
 *  0b0..Calibration value calculation is not requested to be run on ADCB.
 *  0b1..Calibration value calculation for single-ended input mode is requested to be run on ADCB.
 */
#define HSADC_CALIB_REQSINGB(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_REQSINGB_SHIFT)) & HSADC_CALIB_REQSINGB_MASK)
#define HSADC_CALIB_REQDIFB_MASK                 (0x20U)
#define HSADC_CALIB_REQDIFB_SHIFT                (5U)
/*! REQDIFB - ADCB Calibration request for differential mode
 *  0b0..Calibration value calculation is not requested to be run on ADCB.
 *  0b1..Calibration value calculation for differential input mode is requested to be run onr ADCB
 */
#define HSADC_CALIB_REQDIFB(x)                   (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_REQDIFB_SHIFT)) & HSADC_CALIB_REQDIFB_MASK)
#define HSADC_CALIB_BYPB_MASK                    (0x40U)
#define HSADC_CALIB_BYPB_SHIFT                   (6U)
/*! BYPB - ADCB calibration bypass
 *  0b0..ADCB block uses the calibration values to obtain the final conversion result (differential or single-ended mode)
 *  0b1..Calibration operation is bypassed on ADCB.
 */
#define HSADC_CALIB_BYPB(x)                      (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_BYPB_SHIFT)) & HSADC_CALIB_BYPB_MASK)
#define HSADC_CALIB_CAL_REQB_MASK                (0x80U)
#define HSADC_CALIB_CAL_REQB_SHIFT               (7U)
/*! CAL_REQB - Calibration Request for ADCB
 *  0b0..Calibration is not requested.
 *  0b1..Calibration is requested for ADCB.
 */
#define HSADC_CALIB_CAL_REQB(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_CAL_REQB_SHIFT)) & HSADC_CALIB_CAL_REQB_MASK)
#define HSADC_CALIB_EOCALIEA_MASK                (0x100U)
#define HSADC_CALIB_EOCALIEA_SHIFT               (8U)
/*! EOCALIEA - Interrupt Enable for End of Calibration on ADCA
 *  0b0..Interrupt is not enabled.
 *  0b1..Interrupt is enabled.
 */
#define HSADC_CALIB_EOCALIEA(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_EOCALIEA_SHIFT)) & HSADC_CALIB_EOCALIEA_MASK)
#define HSADC_CALIB_EOCALIEB_MASK                (0x200U)
#define HSADC_CALIB_EOCALIEB_SHIFT               (9U)
/*! EOCALIEB - Interrupt Enable for End of Calibration on ADCB
 *  0b0..Interrupt is not enabled.
 *  0b1..Interrupt is enabled.
 */
#define HSADC_CALIB_EOCALIEB(x)                  (((uint16_t)(((uint16_t)(x)) << HSADC_CALIB_EOCALIEB_SHIFT)) & HSADC_CALIB_EOCALIEB_MASK)
/*! @} */

/*! @name CALVAL_A - Calibration Values for ADCA Register */
/*! @{ */
#define HSADC_CALVAL_A_CALVSING_MASK             (0x7FU)
#define HSADC_CALVAL_A_CALVSING_SHIFT            (0U)
#define HSADC_CALVAL_A_CALVSING(x)               (((uint16_t)(((uint16_t)(x)) << HSADC_CALVAL_A_CALVSING_SHIFT)) & HSADC_CALVAL_A_CALVSING_MASK)
#define HSADC_CALVAL_A_CALVDIF_MASK              (0x7F00U)
#define HSADC_CALVAL_A_CALVDIF_SHIFT             (8U)
#define HSADC_CALVAL_A_CALVDIF(x)                (((uint16_t)(((uint16_t)(x)) << HSADC_CALVAL_A_CALVDIF_SHIFT)) & HSADC_CALVAL_A_CALVDIF_MASK)
/*! @} */

/*! @name CALVAL_B - Calibration Values for ADCB Register */
/*! @{ */
#define HSADC_CALVAL_B_CALVSING_MASK             (0x7FU)
#define HSADC_CALVAL_B_CALVSING_SHIFT            (0U)
#define HSADC_CALVAL_B_CALVSING(x)               (((uint16_t)(((uint16_t)(x)) << HSADC_CALVAL_B_CALVSING_SHIFT)) & HSADC_CALVAL_B_CALVSING_MASK)
#define HSADC_CALVAL_B_CALVDIF_MASK              (0x7F00U)
#define HSADC_CALVAL_B_CALVDIF_SHIFT             (8U)
#define HSADC_CALVAL_B_CALVDIF(x)                (((uint16_t)(((uint16_t)(x)) << HSADC_CALVAL_B_CALVDIF_SHIFT)) & HSADC_CALVAL_B_CALVDIF_MASK)
/*! @} */

/*! @name MUX67_SEL - MUX6_7 Selection Controls Register */
/*! @{ */
#define HSADC_MUX67_SEL_CH6_SELA_MASK            (0x7U)
#define HSADC_MUX67_SEL_CH6_SELA_SHIFT           (0U)
#define HSADC_MUX67_SEL_CH6_SELA(x)              (((uint16_t)(((uint16_t)(x)) << HSADC_MUX67_SEL_CH6_SELA_SHIFT)) & HSADC_MUX67_SEL_CH6_SELA_MASK)
#define HSADC_MUX67_SEL_CH7_SELA_MASK            (0x70U)
#define HSADC_MUX67_SEL_CH7_SELA_SHIFT           (4U)
#define HSADC_MUX67_SEL_CH7_SELA(x)              (((uint16_t)(((uint16_t)(x)) << HSADC_MUX67_SEL_CH7_SELA_SHIFT)) & HSADC_MUX67_SEL_CH7_SELA_MASK)
#define HSADC_MUX67_SEL_CH6_SELB_MASK            (0x700U)
#define HSADC_MUX67_SEL_CH6_SELB_SHIFT           (8U)
#define HSADC_MUX67_SEL_CH6_SELB(x)              (((uint16_t)(((uint16_t)(x)) << HSADC_MUX67_SEL_CH6_SELB_SHIFT)) & HSADC_MUX67_SEL_CH6_SELB_MASK)
#define HSADC_MUX67_SEL_CH7_SELB_MASK            (0x7000U)
#define HSADC_MUX67_SEL_CH7_SELB_SHIFT           (12U)
#define HSADC_MUX67_SEL_CH7_SELB(x)              (((uint16_t)(((uint16_t)(x)) << HSADC_MUX67_SEL_CH7_SELB_SHIFT)) & HSADC_MUX67_SEL_CH7_SELB_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group HSADC_Register_Masks */


